/***************************************************************************************************
                        Project                  :                  MPF
                        MCU                      :                  
                        IDE                      :                  MDK5
                        File                     :                  mpf_conf.h
                        Brief                    :                  框架配置文件
                        Developer                :                  金欣嵘
                        Other                    :                  
====================================================================================================

====================================================================================================
                                              History
====================================================================================================
----------------------------------------------------------------------------------------------------
                                            Brief 创建文件
----------------------------------------------------------------------------------------------------
                        Branch                   :                  master
                        Commit                   :                  base
----------------------------------------------------------------------------------------------------
***************************************************************************************************/
#ifndef __MPF_CONF_H__
#define __MPF_CONF_H__

#ifdef __cplusplus
    extern "C" {
#endif

#define ENABLE_PERIPHERAL   0       //是否使能外设框架
#define ENABLE_STORAGE      0       //是否使能外部存储器配置

#if ENABLE_PERIPHERAL
#define MPF_UART            0       //是否使能UART设备配置
#define MPF_SPI             0       //是否使能SPI设备配置
#define MPF_IIC             0       //是否使能IIC设备配置
#endif

#if ENABLE_STORAGE
#define MPF_PSRAM           0       //是否使能eeprom
#define MPF_SPIFLASH        0       //是否使能spi flash
#endif

#ifdef __cplusplus
    }
#endif

#endif
