/***************************************************************************************************
                        Project                  :                  MPF
                        MCU                      :                  
                        IDE                      :                  MDK5
                        File                     :                  mpf_i2c.h
                        Brief                    :                  i2c类接口文件
                        Developer                :                  金欣嵘
                        Other                    :                  
====================================================================================================

====================================================================================================
                                              History
====================================================================================================
----------------------------------------------------------------------------------------------------
                                            Brief 创建文件
----------------------------------------------------------------------------------------------------
                        Branch                   :                  master
                        Commit                   :                  base
----------------------------------------------------------------------------------------------------
***************************************************************************************************/
#ifndef __MPF_I2C_H__
#define __MPF_I2C_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************************************
  * @函数名称 : mpf_iic_init_t
  * @函数返回 : 请以状态返回，以便后续处理
  * @函数功能 : iic外设初始化函数
***************************************************************************************************/
typedef uint8_t (* mpf_iic_init_t) (void);

/***************************************************************************************************
  * @函数名称 : mpf_iic_deinit_t
  * @函数返回 : 请以状态返回，以便后续处理
  * @函数功能 : iic外设失能函数
***************************************************************************************************/
typedef uint8_t (* mpf_iic_deinit_t) (void);

/***************************************************************************************************
  * @函数名称 : mpf_iic_send_byte_t
  * @输入参数 : dev_addr：设备地址，ref_addr：寄存器地址，data_byte：数据字节，timeout：超时时间
  * @输出参数 : NULL
  * @函数返回 : 请以状态返回，以便后续处理
  * @函数功能 : iic发送一个字节
***************************************************************************************************/
typedef uint8_t (* mpf_iic_send_byte_t) (uint8_t dev_addr, uint8_t ref_addr, uint8_t data_byte, uint16_t timeout);

/***************************************************************************************************
  * @函数名称 : mpf_iic_recv_byte_t
  * @输入参数 : dev_addr：设备地址，ref_addr：寄存器地址，timeout：超时时间
  * @输出参数 : data_byte：数据字节
  * @函数返回 : 请以状态返回，以便后续处理
  * @函数功能 : iic发送一个字节
***************************************************************************************************/
typedef uint8_t (* mpf_iic_send_byte_t) (uint8_t dev_addr, uint8_t ref_addr, uint8_t * data_byte, uint16_t timeout);

typedef struct
{
    mpf_iic_init_t mpf_iic_init;            //iic初始化函数
    mpf_iic_deinit_t mpf_iic_deinit;        //iic外设失能函数
    mpf_iic_send_byte_t mpf_iic_send_byte;  //iic发送一个字节
    mpf_iic_recv_byte_t mpf_iic_recv_byte;  //iic接收一个字节
}mpf_iic_api_obj_t;

#ifdef __cplusplus
}
#endif

#endif

